{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "b2f7102d-6d5d-438d-a787-659d19687ae9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pymongo import MongoClient\n",
    "client = MongoClient(\"mongodb://admin:admin123@mongo:27017/\")\n",
    "db = client[\"clase\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "59eba410-cfe5-4f87-b62f-b51c0831e7f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "neo4j = GraphDatabase.driver(\"bolt://neo4j:7687\",\n",
    "auth=(\"neo4j\", \"neo4j123\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "88c9ad30-06e8-40a7-b356-d3e52dd464da",
   "metadata": {},
   "outputs": [],
   "source": [
    "import redis\n",
    "r = redis.Redis(host=\"redis\", port=6379, password=\"redis123\",\n",
    "decode_responses=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d8b349b-f692-4b70-98b6-66b503301fce",
   "metadata": {},
   "source": [
    " #### Neo4J (del A al D)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "15169808-61f3-49a4-b7a5-a759ab613d38",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Todos los usuarios que visitaron BRC:\n",
      "['Ana Torres']\n",
      "['Juan López']\n",
      "['María Pérez']\n",
      "\n",
      "Los amigos de Juan que visitaron sus mismos destinos:\n",
      "María Pérez con destino a: Bariloche\n",
      "\n",
      "Sugerencias para juan:\n",
      "Cancún\n",
      "Madrid\n",
      "Roma\n",
      "\n",
      "Recomendaciones para Juan, basados en viajes de amigos\n",
      "Mendoza\n",
      "Montaña Real\n"
     ]
    }
   ],
   "source": [
    "with neo4j.session() as s:\n",
    "    # ------------\n",
    "    linea = s.run(\"\"\"\n",
    "    MATCH (u:Usuario)-[:VISITO]->(d:Destino {ciudad:\"Bariloche\"})\n",
    "    RETURN u.nombre AS usuario ORDER BY usuario\"\"\")\n",
    "    print('Todos los usuarios que visitaron BRC:')\n",
    "    for r in linea:\n",
    "        print([r[\"usuario\"]])\n",
    "    \n",
    "    # -------------\n",
    "    linea = s.run(\"\"\"\n",
    "    MATCH (juan:Usuario {nombre: 'Juan López'})-[:AMIGO_DE]-(amigo:Usuario),\n",
    "        (juan)-[:VISITO]->(d:Destino),\n",
    "        (amigo)-[:VISITO]->(d)\n",
    "    RETURN amigo.nombre, d.ciudad\"\"\")\n",
    "    print()\n",
    "    print('Los amigos de Juan que visitaron sus mismos destinos:')\n",
    "    for r in linea:\n",
    "        print(r['amigo.nombre'], 'con destino a:',r['d.ciudad'])\n",
    "\n",
    "    # -------------\n",
    "    linea = s.run(\"\"\"\n",
    "    MATCH (u:Usuario {nombre: 'Juan López'})\n",
    "    MATCH (d:Destino)\n",
    "    WHERE NOT (u)-[:VISITO]->(d)\n",
    "      AND NOT EXISTS {\n",
    "        MATCH (u)-[:AMIGO_DE]-(a:Usuario)-[:VISITO]->(d)\n",
    "      }\n",
    "    RETURN DISTINCT d.ciudad AS sugerencia\n",
    "    ORDER BY sugerencia;\n",
    "    \"\"\")\n",
    "    print()\n",
    "    print('Sugerencias para juan:')\n",
    "    for r in linea:\n",
    "        print(r['sugerencia'])\n",
    "\n",
    "    # -------------\n",
    "    linea = s.run(\"\"\"\n",
    "    MATCH (u:Usuario {nombre: 'Juan López'})\n",
    "    MATCH (u)-[:AMIGO_DE]-(a:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WHERE NOT (u)-[:VISITO]->(d)\n",
    "    RETURN DISTINCT d.ciudad AS destino\n",
    "    \"\"\")\n",
    "    print()\n",
    "    print('Recomendaciones para Juan, basados en viajes de amigos')\n",
    "    recomendaciones = []\n",
    "    for r in linea:\n",
    "        print(r['destino'])\n",
    "        recomendaciones.append(r['destino'])\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0c543dc5-3592-40a0-bf3a-3108d7fb6fec",
   "metadata": {},
   "source": [
    "#### MongoDB\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "54f7ff7b-db06-4b2e-be2e-d705488df34e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Montaña Real\n"
     ]
    }
   ],
   "source": [
    "# Hoteles en los destinos recomendados (solo nombre)\n",
    "for h in db.hoteles.find({\"ciudad\": {\"$in\": recomendaciones}}, {\"_id\": 0, \"nombre\": 1}):\n",
    "    print(h[\"nombre\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dc1834d1-dae9-47f3-ae28-9882ccc57b99",
   "metadata": {},
   "source": [
    "#### Redis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5cfd3a79-34aa-488f-99a9-71a8b51ee209",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
